Revit 2027 API
ReinforcementSettings.GetReinforcementSettings Method
 Obtains the ReinforcementSettings object for the specified project document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ReinforcementSettings GetReinforcementSettings(
	Document document
)
Public Shared Function GetReinforcementSettings (
	document As Document
) As ReinforcementSettings
public:
static ReinforcementSettings^ GetReinforcementSettings(
	Document^ document
)
static member GetReinforcementSettings :
        document : Document -> ReinforcementSettings
Parameters
document Document
 A project document.
Return Value
ReinforcementSettings
 The ReinforcementSettings object.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace